{
    "data":
    [
        {
            "id": 1,
            "title": "C#",
            "text": "C# - это мощный объектно-ориентированный язык программирования, разработанный компанией Microsoft для создания приложений, работающих в среде .NET Framework. Он поддерживает множество парадигм программирования, включая императивное, декларативное, функциональное, объектно-ориентированное и обобщенное программирование. C# широко используется в разработке настольных приложений, веб-приложений, мобильных приложений, игр и других программных продуктов.",
            "create_date": "2023-02-15T12:00:00Z",
            "posting_date": "2024-02-15T12:00:00Z",
            "image_url": "https://www.javacodegeeks.com/wp-content/uploads/2024/01/pngegg-1-1.png"
        },
        {
            "id": 2,
            "title": "JavaScript",
            "text": "JavaScript - это популярный динамический язык программирования, используемый для создания интерактивных веб-страниц и веб-приложений. Он поддерживает множество парадигм программирования, включая императивное, объектно-ориентированное и функциональное программирование. JavaScript широко используется в разработке веб-приложений, мобильных приложений, игр и других программных продуктов. Он также является важным компонентом современных веб-технологий, таких как HTML5, CSS3 и WebGL.",
            "create_date": "2023-03-01T09:00:00Z",
            "posting_date": "2023-03-15T09:00:00Z",
            "image_url": "https://play-lh.googleusercontent.com/FzFN8wP96JTCI9GMo4XWaJ-VzLdYpAY000eLFPfeY6Il4vbaXayOgtciZf75WORcKQuj"
        },
        {
            "id": 3,
            "title": "Python",
            "text": "Интерпретируемый высокоуровневый язык программирования общего назначения. Поддерживает несколько парадигм программирования, в том числе объектно-ориентированную, императивную и функциональную. Один из самых популярных языков программирования в мире, широко используется в науке, образовании, веб-разработке, автоматизации и других областях.",
            "create_date": "2021-05-20T12:00:00Z",
            "posting_date": "2023-09-15T16:30:00Z",
            "image_url": "https://gitlab.com/uploads/-/system/project/avatar/17350333/pngguru.com__1_.png"
        },
        {
            "id": 4,
            "title": "Java",
            "text": "Объектно-ориентированный язык программирования общего назначения. Разработан в 1991 году Джеймсом Гослингом и его командой в Sun Microsystems. Широко используется в разработке приложений для Android, веб-приложениях, серверных приложениях и других областях. Поддерживает множество библиотек и фреймворков, таких как Spring, Hibernate, JUnit и других.",
            "create_date": "2022-02-10T09:00:00Z",
            "posting_date": "2025-06-05T14:15:00Z",
            "image_url": "https://www.tsoftit.com/wp-content/uploads/2015/12/java-icon-tm.png"
        },
        {
            "id": 5,
            "title": "C++",
            "text": "Язык программирования общего назначения, разработанный Бьярне Страустропом в 1979 году. Поддерживает объектно-ориентированное, императивное и генерическое программирование. Широко используется в разработке системного программного обеспечения, игр, приложений для рабочих станций и других областей. Является расширением языка C и имеет с ним высокую степень совместимости.",
            "create_date": "2020-11-01T18:00:00Z",
            "posting_date": "2022-11-01T18:00:00Z",
            "image_url": "https://windows10free.ru/uploads/posts/2017-01/1484638360_c-unofficial.sh-600x600.png"
        },
        {
            "id": 6,
            "title": "Ruby",
            "text": "Динамический, объектно-ориентированный язык программирования, разработанный Йукихиро Мацумото в 1993 году. Поддерживает множество парадигм программирования, в том числе функциональную, императивную и метапрограммирование. Широко используется в разработке веб-приложений, благодаря популярному фреймворку Ruby on Rails. Также используется в науке, образовании и других областях.",
            "create_date": "2022-07-01T12:00:00Z",
            "posting_date": "2023-07-01T12:00:00Z",
            "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Devicon-ruby-plain-wordmark.svg/640px-Devicon-ruby-plain-wordmark.svg.png"
        },
        {
            "id": 7,
            "title": "Swift",
            "text": "Язык программирования, разработанный Apple для разработки приложений для iOS, macOS, watchOS и tvOS. Поддерживает объектно-ориентированное и функциональное программирование. Отличается высокой производительностью, безопасностью и современным синтаксисом. Широко используется в разработке мобильных приложений и игр.",
            "create_date": "2021-03-01T15:00:00Z",
            "posting_date": "2022-03-01T15:00:00Z",
            "image_url": "https://technowow.net/images/swift.png"
        },
        {
            "id": 8,
            "title": "Kotlin",
            "text": "Статически типизированный язык программирования, разработанный JetBrains для разработки приложений для Android и JVM. Поддерживает объектно-ориентированное и функциональное программирование. Отличается высокой производительностью, безопасностью и современным синтаксисом. Широко используется в разработке мобильных приложений и серверных приложений.",
            "create_date": "2020-09-01T10:00:00Z",
            "posting_date": "2022-09-01T10:00:00Z",
            "image_url": "https://codengineering.net/uploads/images/23610/23610.jpg"
        },
        {
            "id": 9,
            "title": "Go",
            "text": "Статически типизированный компилируемый язык программирования, разработанный в 2007 году Робертом Гриземер, Робом Пайком и Кеном Томпсоном. Поддерживает императивное и объектно-ориентированное программирование. Отличается высокой производительностью, простотой и надежностью. Широко используется в разработке системного программного обеспечения, сетевых приложений и других областях.",
            "create_date": "2022-01-01T00:00:00Z",
            "posting_date": "2023-01-01T00:00:00Z",
            "image_url": "https://brandlogos.net/wp-content/uploads/2021/12/go_language-brandlogo.net_.png"
        },
        {
            "id": 10,
            "title": "Rust",
            "text": "Статически типизированный компилируемый язык программирования, разработанный в 2010 году Греем Доннеллом и его командой в Mozilla Research. Поддерживает императивное, функциональное и объектно-ориентированное программирование. Отличается высокой производительностью, безопасностью и низким уровнем абстракции. Широко используется в разработке системного программного обеспечения, игр и других областях.",
            "create_date": "2021-10-01T16:00:00Z",
            "posting_date": "2022-10-01T16:00:00Z",
            "image_url": "https://downloads.marketplace.jetbrains.com/files/21576/351212/icon/pluginIcon.png"
        }
    ]
}
